cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3C1x6_SVD.xml
									<name>ADCN17</name>
									<description>Select channel ADCn.17 (Voltage at VREGIN / 4).</description>
									<value>17</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN18</name>
									<description>Select channel ADCn.18 (EXTVREG0 Current Sense).</description>
									<value>18</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN19</name>
									<description>Select channel ADCn.19 (VIO).</description>
									<value>19</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN20</name>
									<description>Select channel ADCn.20 (Temperature Sensor Output).</description>
									<value>20</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN21</name>
									<description>Select channel ADCn.21 (VIOHD / 4).</description>
									<value>21</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN22</name>
									<description>Select channel ADCn.22 (RESERVED).</description>
									<value>22</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN23</name>
									<description>Select channel ADCn.23 (RESERVED).</description>
									<value>23</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN24</name>
									<description>Select channel ADCn.24 (RESERVED).</description>
									<value>24</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN25</name>
									<description>Select channel ADCn.25 (RESERVED).</description>
									<value>25</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN26</name>
									<description>Select channel ADCn.26 (RESERVED).</description>
									<value>26</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN27</name>
									<description>Select channel ADCn.27 (RESERVED).</description>
									<value>27</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN28</name>
									<description>Select channel ADCn.28 (RESERVED).</description>
									<value>28</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN29</name>
									<description>Select channel ADCn.29 (RESERVED).</description>
									<value>29</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN30</name>
									<description>Select channel ADCn.30 (RESERVED).</description>
									<value>30</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>END</name>
									<description>None - End the sequence.</description>
									<value>31</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TS3CHR</name>
							<description>Time Slot 3 Conversion Characteristic. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>CC0</name>
									<description>Select conversion characteristic 0 for time slot 3.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC1</name>
									<description>Select conversion characteristic 1 for time slot 3.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC2</name>
									<description>Select conversion characteristic 2 for time slot 3.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CC3</name>
									<description>Select conversion characteristic 3 for time slot 3.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TS3MUX</name>
							<description>Time Slot 3 Input Channel. </description>
							<bitOffset>26</bitOffset>
							<bitWidth>5</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ADCN0</name>
									<description>Select channel ADCn.0 (PB1.11).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN1</name>
									<description>Select channel ADCn.1 (PB1.10).</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN2</name>
									<description>Select channel ADCn.2 (PB1.9).</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN3</name>
									<description>Select channel ADCn.3 (PB1.8).</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN4</name>
									<description>Select channel ADCn.4 (PB1.7).</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN5</name>
									<description>Select channel ADCn.5 (PB1.6).</description>
									<value>5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN6</name>
									<description>Select channel ADCn.6 (PB0.10).</description>
									<value>6</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN7</name>
									<description>Select channel ADCn.7 (PB1.5).</description>
									<value>7</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN8</name>
									<description>Select channel ADCn.8 (PB1.4).</description>
									<value>8</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN9</name>
									<description>Select channel ADCn.9 (RESERVED).</description>
									<value>9</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN10</name>
									<description>Select channel ADCn.10 (PB1.3).</description>
									<value>10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN11</name>
									<description>Select channel ADCn.11 (PB1.2).</description>
									<value>11</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN12</name>
									<description>Select channel ADCn.12 (PB0.14).</description>
									<value>12</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN13</name>
									<description>Select channel ADCn.13 (PB0.15).</description>
									<value>13</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN14</name>
									<description>Select channel ADCn.14 (PB1.0).</description>
									<value>14</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN15</name>
									<description>Select channel ADCn.15 (PB1.1).</description>
									<value>15</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN16</name>
									<description>Select channel ADCn.16 (IVC0.1 Output (IVC0C1)).</description>
									<value>16</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN17</name>
									<description>Select channel ADCn.17 (Voltage at VREGIN / 4).</description>
									<value>17</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN18</name>
									<description>Select channel ADCn.18 (EXTVREG0 Current Sense).</description>
									<value>18</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN19</name>
									<description>Select channel ADCn.19 (VIO).</description>
									<value>19</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN20</name>
									<description>Select channel ADCn.20 (Temperature Sensor Output).</description>
									<value>20</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN21</name>
									<description>Select channel ADCn.21 (VIOHD / 4).</description>
									<value>21</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN22</name>
									<description>Select channel ADCn.22 (RESERVED).</description>
									<value>22</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN23</name>
									<description>Select channel ADCn.23 (RESERVED).</description>
									<value>23</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN24</name>
									<description>Select channel ADCn.24 (RESERVED).</description>
									<value>24</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN25</name>
									<description>Select channel ADCn.25 (RESERVED).</description>
									<value>25</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN26</name>
									<description>Select channel ADCn.26 (RESERVED).</description>
									<value>26</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN27</name>
									<description>Select channel ADCn.27 (RESERVED).</description>
									<value>27</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN28</name>
									<description>Select channel ADCn.28 (RESERVED).</description>
									<value>28</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN29</name>
									<description>Select channel ADCn.29 (RESERVED).</description>
									<value>29</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ADCN30</name>
									<description>Select channel ADCn.30 (RESERVED).</description>
									<value>30</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>END</name>
									<description>None - End the sequence.</description>
									<value>31</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CHAR32</name>
					<description>Conversion Characteristic 2 and 3 Setup</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CHR2GN</name>
							<description>Conversion Characteristic 2 Gain. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNITY</name>
									<description>The on-chip PGA gain is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HALF</name>
									<description>The on-chip PGA gain is 0.5.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHR2RPT</name>
							<description>Conversion Characteristic 2 Repeat Counter. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ACC1</name>
									<description>Accumulate one sample.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC4</name>
									<description>Accumulate four samples.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC8</name>
									<description>Accumulate eight samples.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC16</name>
									<description>Accumulate sixteen samples.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC32</name>
									<description>Accumulate thirty-two samples (10-bit mode only).</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC64</name>
									<description>Accumulate sixty-four samples (10-bit mode only).</description>
									<value>5</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHR2LS</name>
							<description>Conversion Characteristic 2 Left-Shift Bits. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>CHR2RSEL</name>
							<description>Conversion Characteristic 2 Resolution Selection. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>B10</name>
									<description>Select 10-bit Mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>B12</name>
									<description>Select 12-bit Mode (burst mode must be enabled).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHR2WCIEN</name>
							<description>Conversion Characteristic 2 Window Comparator Interrupt Enable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable window comparison interrupts.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled window comparison interrupts.  The window comparator will be used to check the ADC result on channels that use this characteristic.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHR3GN</name>
							<description>Conversion Characteristic 3 Gain. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>UNITY</name>
									<description>The on-chip PGA gain is 1.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HALF</name>
									<description>The on-chip PGA gain is 0.5.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHR3RPT</name>
							<description>Conversion Characteristic 3 Repeat Counter. </description>
							<bitOffset>17</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>ACC1</name>
									<description>Accumulate one sample.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC4</name>
									<description>Accumulate four samples.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC8</name>
									<description>Accumulate eight samples.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC16</name>
									<description>Accumulate sixteen samples.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC32</name>
									<description>Accumulate thirty-two samples (10-bit mode only).</description>
									<value>4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ACC64</name>
									<description>Accumulate sixty-four samples (10-bit mode only).</description>
									<value>5</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHR3LS</name>
							<description>Conversion Characteristic 3 Left-Shift Bits. </description>
							<bitOffset>20</bitOffset>
							<bitWidth>3</bitWidth>
						</field>
						<field>
							<name>CHR3RSEL</name>
							<description>Conversion Characteristic 3 Resolution Selection. </description>
							<bitOffset>23</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>B10</name>
									<description>Select 10-bit Mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>B12</name>
									<description>Select 12-bit Mode (burst mode must be enabled).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CHR3WCIEN</name>
							<description>Conversion Characteristic 3 Window Comparator Interrupt Enable. </description>
							<bitOffset>24</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable window comparison interrupts.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enabled window comparison interrupts.  The window comparator will be used to check the ADC result on channels that use this characteristic.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
