cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3C1x6_SVD.xml
				<register>
					<name>IFRCST_0</name>
					<description>Interface Read Control States</description>
					<addressOffset>0xb0</addressOffset>
					<resetValue>0x00000FBB</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CSRAS</name>
							<description>Chip Select Read Address Setup State. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set chip select (CSx) to low during the read address setup state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set chip select (CSx) to high during the read address setup state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CSRAH</name>
							<description>Chip Select Read Address Hold State. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set chip select (CSx) to low during the read address hold state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set chip select (CSx) to high during the read address hold state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CSRDW</name>
							<description>Chip Select Read Data Wait State. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set chip select (CSx) to low during the read data wait state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set chip select (CSx) to high during the read data wait state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CSRDH</name>
							<description>Chip Select Read Data Hold State. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set chip select (CSx) to low during the read data hold state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set chip select (CSx) to high during the read data hold state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OERAS</name>
							<description>Output Enable Read Address Setup State. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set output enable (/OE) to low during the read address setup state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set output enable (/OE) to high during the read address setup state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OERAH</name>
							<description>Output Enable Read Address Hold State. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set output enable (/OE) to low during the read address hold state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set output enable (/OE) to high during the read address hold state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OERDW</name>
							<description>Output Enable Read Data Wait State. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set output enable (/OE) to low during the read data wait state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set output enable (/OE) to high during the read data wait state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OERDH</name>
							<description>Output Enable Read Data Hold State. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set output enable (/OE) to low during the read data hold state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set output enable (/OE) to high during the read data hold state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WRRAS</name>
							<description>Write Signal Read Address Setup State. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set write signal (/WR) to low during the read address setup state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set write signal (/WR) to high during the read address setup state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WRRAH</name>
							<description>Write Signal Read Address Hold State. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set write signal (/WR) to low during the read address hold state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set write signal (/WR) to high during the read address hold state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WRRDW</name>
							<description>Write Signal Read Data Wait State. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set write signal (/WR) to low during the read data wait state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set write signal (/WR) to high during the read data wait state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WRRDH</name>
							<description>Write Signal Read Data Hold State. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set write signal (/WR) to low during the read data hold state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set write signal (/WR) to high during the read data hold state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ALERAS</name>
							<description>Address Latch Enable Read Address Setup State. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set address latch enable (ALEm) to low during the read address setup state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set address latch enable (ALEm) to high during the read address setup state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ALERAH</name>
							<description>Address Latch Enable Read Address Hold State. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set address latch enable (ALEm) to low during the read address hold state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set address latch enable (ALEm) to high during the read address hold state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ALERDW</name>
							<description>Address Latch Enable Read Data Wait State. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set address latch enable (ALEm) to low during the read data wait state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set address latch enable (ALEm) to high during the read data wait state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ALERDH</name>
							<description>Address Latch Enable Read Data Hold State. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set address latch enable (ALEm) to low during the read data hold state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set address latch enable (ALEm) to high during the read data hold state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>IFWCST_0</name>
					<description>Interface Write Control States</description>
					<addressOffset>0xc0</addressOffset>
					<resetValue>0x00000BFB</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CSWAS</name>
							<description>Chip Select Write Address Setup State. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set chip select (CSx) to low during the write address setup state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set chip select (CSx) to high during the write address setup state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CSWAH</name>
							<description>Chip Select Write Address Hold State. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set chip select (CSx) to low during the write address hold state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set chip select (CSx) to high during the write address hold state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CSWDW</name>
							<description>Chip Select Write Data Wait State. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set chip select (CSx) to low during the write data wait state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set chip select (CSx) to high during the write data wait state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CSWDH</name>
							<description>Chip Select Write Data Hold State. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set chip select (CSx) to low during the write data hold state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set chip select (CSx) to high during the write data hold state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEWAS</name>
							<description>Output Enable Write Address Setup State. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set output enable (/OE) to low during the write address setup state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set output enable (/OE) to high during the write address setup state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEWAH</name>
							<description>Output Enable Write Address Hold State. </description>
							<bitOffset>5</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set output enable (/OE) to low during the write address hold state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set output enable (/OE) to high during the write address hold state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEWDW</name>
							<description>Output Enable Write Data Wait State. </description>
							<bitOffset>6</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set output enable (/OE) to low during the write data wait state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set output enable (/OE) to high during the write data wait state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OEWDH</name>
							<description>Output Enable Write Data Hold State. </description>
							<bitOffset>7</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set output enable (/OE) to low during the write data hold state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set output enable (/OE) to high during the write data hold state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WRWAS</name>
							<description>Write Signal Write Address Setup State. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set write signal (/WR) to low during the write address setup state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set write signal (/WR) to high during the write address setup state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WRWAH</name>
							<description>Write Signal Write Address Hold State. </description>
							<bitOffset>9</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set write signal (/WR) to low during the write address hold state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set write signal (/WR) to high during the write address hold state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WRWDW</name>
							<description>Write Signal Write Data Wait State. </description>
							<bitOffset>10</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set write signal (/WR) to low during the write data wait state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set write signal (/WR) to high during the write data wait state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WRWDH</name>
							<description>Write Signal Write Data Hold State. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set write signal (/WR) to low during the write data hold state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set write signal (/WR) to high during the write data hold state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ALEWAS</name>
							<description>Address Latch Enable Write Address Setup State. </description>
							<bitOffset>12</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set address latch enable (ALEm) to low during the write address setup state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set address latch enable (ALEm) to high during the write address setup state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ALEWAH</name>
							<description>Address Latch Enable Write Address Hold State. </description>
							<bitOffset>13</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set address latch enable (ALEm) to low during the write address hold state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set address latch enable (ALEm) to high during the write address hold state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ALEWDW</name>
							<description>Address Latch Enable Write Data Wait State. </description>
							<bitOffset>14</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set address latch enable (ALEm) to low during the write data wait state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set address latch enable (ALEm) to high during the write data wait state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ALEWDH</name>
							<description>Address Latch Enable Write Data Hold State. </description>
							<bitOffset>15</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>Set address latch enable (ALEm) to low during the write data hold state.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>Set address latch enable (ALEm) to high during the write data hold state.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
