cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3C1x6_SVD.xml
				<!--BASEPOINTER_START_3-->
				<register>
					<name>MODE_1</name>
					<description>Channel Capture/Compare Mode</description>
					<addressOffset>0x40</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>COSEL</name>
							<description>Channel Output Function Select. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>2</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>TOGGLE_OUTPUT</name>
									<description>Toggle the channel output at the next capture/compare, overflow, or intermediate event.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET_OUTPUT</name>
									<description>Set the channel output at the next capture/compare, overflow, or intermediate event.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CLEAR_OUTPUT</name>
									<description>Clear the output at the next capture/compare, overflow, or intermediate event.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NO_CHANGE</name>
									<description>Capture/Compare, overflow, or intermediate events do not control the output state.</description>
									<value>3</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWMMD</name>
							<description>PWM N-Bit Mode. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>4</bitWidth>
						</field>
						<field>
							<name>CMD</name>
							<description>Channel Operating Mode. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>3</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>EDGE_PWM</name>
									<description>Configure the channel for edge-aligned PWM mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CENTER_ALIGNED_PWM</name>
									<description>Configure the channel for center-aligned PWM mode.</description>
									<value>1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HF_SQUARE_WAVE</name>
									<description>Configure the channel for high-frequency/square-wave mode.</description>
									<value>2</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>TIMER_CAPTURE</name>
									<description>Configure the channel for timer/capture mode.</description>
									<value>3</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>N_BIT_PWM</name>
									<description>Configure the channel for n-bit edge-aligned PWM mode.</description>
									<value>4</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CONTROL_1</name>
					<description>Channel Capture/Compare Control</description>
					<addressOffset>0x50</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>COUTST</name>
							<description>Channel Output State. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>LOW</name>
									<description>The channel output state is low.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HIGH</name>
									<description>The channel output state is high.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CPCAPEN</name>
							<description>Positive Edge Input Capture Enable. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable positive-edge input capture.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable positive-edge input capture.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CNCAPEN</name>
							<description>Negative Edge Input Capture Enable. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable negative-edge input capture.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable negative-edge input capture.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CUPDCF</name>
							<description>Channel Register Update Complete Flag. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>A PCA channel register update completed or is not pending.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>A PCA channel register update has not completed and is still pending.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCIEN</name>
							<description>Capture/Compare Interrupt Enable. </description>
							<bitOffset>8</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the channel capture/compare interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the channel capture/compare interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CIOVFIEN</name>
							<description>Intermediate Overflow Interrupt Enable. </description>
							<bitOffset>11</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the channel intermediate overflow interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the channel intermediate overflow interrupt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CCAPV_1</name>
					<description>Channel Compare Value</description>
					<addressOffset>0x60</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CCAPV</name>
							<description>Channel Compare Value. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>18</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>CCAPVUPD_1</name>
					<description>Channel Compare Update Value</description>
					<addressOffset>0x70</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CCAPVUPD</name>
							<description>Channel Compare Update Value. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>18</bitWidth>
						</field>
					</fields>
				</register>
