cmsis-svd/cmsis-svd/data/SiliconLabs/SIM3C1x6_SVD.xml
			</registers>
		</peripheral>
		<peripheral>
			<name>WDTIMER_0</name>
			<version>A</version>
			<description>None</description>
			<groupName>WDTIMER_0</groupName>
			<baseAddress>0x40030000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xffc</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>WDTIMER_IRQn</name>
				<value>0</value>
			</interrupt>
			<registers>
				<!--BASEPOINTER_START_1-->
				<register>
					<name>CONTROL</name>
					<description>Module Control</description>
					<addressOffset>0x0</addressOffset>
					<resetValue>0x00000002</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EWIEN</name>
							<description>Early Warning Interrupt Enable. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>DISABLED</name>
									<description>Disable the early warning interrupt (EWI).</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>ENABLED</name>
									<description>Enable the early warning interrupt (EWI).</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DBGMD</name>
							<description>Watchdog Timer Debug Mode. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>RUN</name>
									<description>The WDTIMER module will continue to operate while the core is halted in debug mode.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>HALT</name>
									<description>A debug breakpoint will cause the WDTIMER module to halt.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Module Status</description>
					<addressOffset>0x10</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>KEYSTS</name>
							<description>Key Status. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>IDLE</name>
									<description>No keys have been processed by the interface.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>READY</name>
									<description>The attention key has been received and the module is awaiting a command.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PRIVSTS</name>
							<description>Register Access Status. </description>
							<bitOffset>1</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>READ_ONLY</name>
									<description>The watchdog timer registers are currently read-only.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>READ_WRITE</name>
									<description>A write transaction can be performed on the module registers.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EWI</name>
							<description>Early Warning Interrupt Flag. </description>
							<bitOffset>2</bitOffset>
							<bitWidth>1</bitWidth>
							<enumeratedValues>
								<enumeratedValue>
									<name>NOT_SET</name>
									<description>Read: An early warning match did not occur. Write: Clear the early warning interrupt.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>SET</name>
									<description>Read: An early warning match occurred and the interrupt is pending. Write: Force a watchdog timer early warning interrupt to occur.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTHF</name>
							<description>Reset Threshold Flag. </description>
							<bitOffset>3</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>LT</name>
									<description>The counter is currently less than the reset threshold (RTH) value.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>GTE</name>
									<description>The counter is currently greater than or equal to the reset threshold (RTH) value.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>UPDSTS</name>
							<description>Watchdog Timer Threshold Update Status. </description>
							<bitOffset>4</bitOffset>
							<bitWidth>1</bitWidth>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>IDLE</name>
									<description>An update completed or is not pending. The EWTH and RTH fields can be written.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>UPDATING</name>
									<description>An update of the threshold register is occurring. The EWTH and RTH fields should not be modified until hardware clears UPDSTS to 0.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>THRESHOLD</name>
					<description>Threshold Values</description>
					<addressOffset>0x20</addressOffset>
					<resetValue>0xFFFF7FFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EWTH</name>
							<description>Early Warning Threshold. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
						<field>
							<name>RTH</name>
							<description>Reset Threshold. </description>
							<bitOffset>16</bitOffset>
							<bitWidth>16</bitWidth>
						</field>
					</fields>
				</register>
				<register>
					<name>WDTKEY</name>
					<description>Module Key</description>
					<addressOffset>0x30</addressOffset>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>KEY</name>
							<description>Watchdog Timer Key. </description>
							<bitOffset>0</bitOffset>
							<bitWidth>8</bitWidth>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>ATTN</name>
									<description>Attention key to start the command sequence.</description>
									<value>165</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RESET</name>
									<description>Reset the watchdog timer.</description>
									<value>204</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DISABLE</name>
									<description>Disable the watchdog timer.</description>
									<value>221</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>START</name>
									<description>Start the watchdog timer.</description>
									<value>238</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>WRITE</name>
									<description>Allow one write access to the module registers.</description>
									<value>241</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>LOCK</name>
									<description>Lock the module from any other writes until the next system reset.</description>
									<value>255</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
	</peripherals>
</device>
